blog/2010/05/23/solar-and-solar-win-directory-of-a-conjecture/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Solar目录分析及Solar-Win的一个猜想 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>Solar目录分析及Solar-Win的一个猜想</h1>
  <ol class="org-ol">
<li>/include目录
</li>
</ol>
<p>
[root@localhost include]# ls -l
total 8
Acme -&gt; ../source/acme/Acme
Example -&gt; ../source/example/Example
Mock
Solar -&gt; ../source/solar/Solar
Solar.php -&gt; ../source/solar/Solar.php
Test
</p>

<p>
从上面可以看出，/include目录里面只有Mock和Test两个目录，其余的都为symlink（符号链接），那我们再来看看Mock和Test目录：
1.1 首先是/include/Mock目录
[root@localhost Mock]# ll
total 0
Acme -&gt; ../../source/acme/tests/Mock/Acme
Example -&gt; ../../source/example/tests/Mock/Example
Solar -&gt; ../../source/solar/tests/Mock/Solar
1.2 接着是/include/Test目录
[root@localhost Test]# ll
total 0
Acme -&gt; ../../source/acme/tests/Test/Acme
Example -&gt; ../../source/example/tests/Test/Example
Solar -&gt; ../../source/solar/tests/Test/Solar
Solar.php -&gt; ../../source/solar/tests/Test/Solar.php
可以看出，/include/Mock和/include/Test的内容也都是符号链接
</p>

<ol class="org-ol">
<li>再来看/script目录
</li>
</ol>
<p>
[root@localhost script]# ll -l
total 0
acme -&gt; ../source/solar/script/solar
example -&gt; ../source/solar/script/solar
solar -&gt; ../source/solar/script/solar
也都是符号链接
</p>
<ol class="org-ol">
<li>/docroot目录
</li>
</ol>
<p>
[root@localhost docroot]# ll
total 56
index.php
info.php
public
两个文件一个目录，这是solar官方推荐的网站入口，附件资源一般都放public目录下。来看看public
3.1 <i>docroot/public</i>
此目录是按照vendor组织的链接到各个App Public目录符号链接。
</p>

<p>
据此可以看出，只要把这些符号链接弄好了，那么在windows下正式使用solar不再是遥不可及的事情，而是真实的摆在眼前的事情。
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
